
### :robot: Terraform Report
---
##### Plan: `55` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.base.azapi_resource.hci_alerts[0] will be created
  + resource "azapi_resource" "hci_alerts" {
      + body                      = {
          + properties = {
              + extensionParameters = {
                  + autoUpgradeMinorVersion = false
                  + enableAutomaticUpgrade  = true
                  + publisher               = "Microsoft.AzureStack.HCI.Alerts"
                  + settings                = {}
                  + type                    = "AlertsForWindowsHCI"
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "AzureEdgeAlerts"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.AzureStackHCI/clusters/ArcSettings/Extensions@2023-08-01"
    }

  # module.base.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "iacado-rg"
      + tags     = {
          + "siteId" = "iacado"
        }
    }

  # module.base.module.aks_arc.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.base.module.aks_arc.data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.base.module.aks_arc.data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/base.aks_arc"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.base.module.aks_arc.azapi_resource.connected_cluster will be created
  + resource "azapi_resource" "connected_cluster" {
      + body                      = {
          + kind       = "ProvisionedCluster"
          + properties = {
              + aadProfile                = {
                  + adminGroupObjectIDs = [
                      + "ed888f99-66c1-48fe-992f-030f49ba50ed",
                    ]
                  + enableAzureRBAC     = true
                  + tenantID            = (known after apply)
                }
              + agentPublicKeyCertificate = ""
              + arcAgentProfile           = {
                  + agentAutoUpgrade = "Enabled"
                }
              + azureHybridBenefit        = null
              + distribution              = null
              + infrastructure            = null
              + privateLinkState          = null
              + provisioningState         = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "iacado-aksArc"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Kubernetes/connectedClusters@2024-01-01"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.base.module.aks_arc.azapi_resource.provisioned_cluster_instance will be created
  + resource "azapi_resource" "provisioned_cluster_instance" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + agentPoolProfiles      = [
                  + {
                      + count             = 1
                      + enableAutoScaling = false
                      + osSKU             = "CBLMariner"
                      + osType            = "Linux"
                      + vmSize            = "Standard_A4_v2"
                    },
                ]
              + cloudProviderProfile   = {
                  + infraNetworkProfile = {
                      + vnetSubnetIds = [
                          + (known after apply),
                        ]
                    }
                }
              + clusterVMAccessProfile = {}
              + controlPlane           = {
                  + controlPlaneEndpoint = {
                      + hostIP = "192.168.1.190"
                    }
                  + count                = 1
                  + vmSize               = "Standard_A4_v2"
                }
              + kubernetesVersion      = "1.28.5"
              + licenseProfile         = {
                  + azureHybridBenefit = "False"
                }
              + linuxProfile           = {
                  + ssh = {
                      + publicKeys = [
                          + {
                              + keyData = (known after apply)
                            },
                        ]
                    }
                }
              + networkProfile         = {
                  + loadBalancerProfile = {
                      + count = 0
                    }
                  + networkPolicy       = "calico"
                  + podCidr             = "10.244.0.0/16"
                }
              + storageProfile         = {
                  + nfsCsiDriver = {
                      + enabled = true
                    }
                  + smbCsiDriver = {
                      + enabled = true
                    }
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "default"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.HybridContainerService/provisionedClusterInstances@2024-01-01"
    }

  # module.base.module.aks_arc.azurerm_key_vault_secret.ssh_private_key_pem[0] will be created
  + resource "azurerm_key_vault_secret" "ssh_private_key_pem" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "AksArcAgentSshPrivateKeyPem"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.aks_arc.azurerm_key_vault_secret.ssh_public_key[0] will be created
  + resource "azurerm_key_vault_secret" "ssh_public_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "AksArcAgentSshPublicKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.aks_arc.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.base.module.aks_arc.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.base.module.aks_arc.terraform_data.replacement[0] will be created
  + resource "terraform_data" "replacement" {
      + id     = (known after apply)
      + input  = (known after apply)
      + output = (known after apply)
    }

  # module.base.module.aks_arc.terraform_data.wait_aks_vhd_ready[0] will be created
  + resource "terraform_data" "wait_aks_vhd_ready" {
      + id = (known after apply)
    }

  # module.base.module.aks_arc.tls_private_key.rsa_key[0] will be created
  + resource "tls_private_key" "rsa_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.base.module.hci_ad_provisioner[0].modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-ptn-hci-ad-provisioner/azurerm"
          + "module_version"  = "0.2.1"
          + "random_id"       = (known after apply)
          + "subscription_id" = "de3c4d5e-af08-451a-a873-438d86ab6f4b"
          + "tenant_id"       = "d9b73d5e-a9d3-41ba-88c3-796a643e3edd"
        }
    }

  # module.base.module.hci_ad_provisioner[0].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.base.module.hci_ad_provisioner[0].terraform_data.ad_creation_provisioner will be created
  + resource "terraform_data" "ad_creation_provisioner" {
      + id = (known after apply)
    }

  # module.base.module.hci_ad_provisioner[0].terraform_data.replacement will be created
  + resource "terraform_data" "replacement" {
      + id     = (known after apply)
      + input  = "iacado-rg"
      + output = (known after apply)
    }

  # module.base.module.hci_cluster.data.azapi_resource.arc_settings will be read during apply
  # (config refers to values not yet known)
 <= data "azapi_resource" "arc_settings" {
      + id          = (known after apply)
      + identity    = (known after apply)
      + location    = (known after apply)
      + name        = "default"
      + output      = (known after apply)
      + parent_id   = (known after apply)
      + resource_id = (known after apply)
      + tags        = (known after apply)
      + type        = "Microsoft.AzureStackHCI/clusters/ArcSettings@2024-04-01"
    }

  # module.base.module.hci_cluster.data.azapi_resource.arcbridge will be read during apply
  # (config refers to values not yet known)
 <= data "azapi_resource" "arcbridge" {
      + id          = (known after apply)
      + identity    = (known after apply)
      + location    = (known after apply)
      + name        = "iacado-cl-arcbridge"
      + output      = (known after apply)
      + parent_id   = (known after apply)
      + resource_id = (known after apply)
      + tags        = (known after apply)
      + type        = "Microsoft.ResourceConnector/appliances@2022-10-27"
    }

  # module.base.module.hci_cluster.data.azapi_resource.customlocation will be read during apply
  # (config refers to values not yet known)
 <= data "azapi_resource" "customlocation" {
      + id          = (known after apply)
      + identity    = (known after apply)
      + location    = (known after apply)
      + name        = "iacado-customlocation"
      + output      = (known after apply)
      + parent_id   = (known after apply)
      + resource_id = (known after apply)
      + tags        = (known after apply)
      + type        = "Microsoft.ExtendedLocation/customLocations@2021-08-15"
    }

  # module.base.module.hci_cluster.data.azapi_resource_list.user_storages will be read during apply
  # (config refers to values not yet known)
 <= data "azapi_resource_list" "user_storages" {
      + id                     = (known after apply)
      + output                 = (known after apply)
      + parent_id              = (known after apply)
      + response_export_values = [
          + "*",
        ]
      + type                   = "Microsoft.AzureStackHCI/storagecontainers@2022-12-15-preview"
    }

  # module.base.module.hci_cluster.data.azurerm_arc_machine.arcservers["AzSHOST1"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_arc_machine" "arcservers" {
      + active_directory_fqdn          = (known after apply)
      + agent                          = (known after apply)
      + agent_version                  = (known after apply)
      + client_public_key              = (known after apply)
      + cloud_metadata                 = (known after apply)
      + detected_properties            = (known after apply)
      + display_name                   = (known after apply)
      + dns_fqdn                       = (known after apply)
      + domain_name                    = (known after apply)
      + id                             = (known after apply)
      + identity                       = (known after apply)
      + last_status_change_time        = (known after apply)
      + location                       = (known after apply)
      + location_data                  = (known after apply)
      + machine_fqdn                   = (known after apply)
      + mssql_discovered               = (known after apply)
      + name                           = "AzSHOST1"
      + os_name                        = (known after apply)
      + os_profile                     = (known after apply)
      + os_sku                         = (known after apply)
      + os_type                        = (known after apply)
      + os_version                     = (known after apply)
      + parent_cluster_resource_id     = (known after apply)
      + private_link_scope_resource_id = (known after apply)
      + resource_group_name            = (known after apply)
      + service_status                 = (known after apply)
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + vm_id                          = (known after apply)
      + vm_uuid                        = (known after apply)
    }

  # module.base.module.hci_cluster.data.azurerm_arc_machine.arcservers["AzSHOST2"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_arc_machine" "arcservers" {
      + active_directory_fqdn          = (known after apply)
      + agent                          = (known after apply)
      + agent_version                  = (known after apply)
      + client_public_key              = (known after apply)
      + cloud_metadata                 = (known after apply)
      + detected_properties            = (known after apply)
      + display_name                   = (known after apply)
      + dns_fqdn                       = (known after apply)
      + domain_name                    = (known after apply)
      + id                             = (known after apply)
      + identity                       = (known after apply)
      + last_status_change_time        = (known after apply)
      + location                       = (known after apply)
      + location_data                  = (known after apply)
      + machine_fqdn                   = (known after apply)
      + mssql_discovered               = (known after apply)
      + name                           = "AzSHOST2"
      + os_name                        = (known after apply)
      + os_profile                     = (known after apply)
      + os_sku                         = (known after apply)
      + os_type                        = (known after apply)
      + os_version                     = (known after apply)
      + parent_cluster_resource_id     = (known after apply)
      + private_link_scope_resource_id = (known after apply)
      + resource_group_name            = (known after apply)
      + service_status                 = (known after apply)
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + vm_id                          = (known after apply)
      + vm_uuid                        = (known after apply)
    }

  # module.base.module.hci_cluster.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.base.module.hci_cluster.data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.base.module.hci_cluster.data.azurerm_key_vault.key_vault[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "iacautomationado"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "zilutest"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.base.module.hci_cluster.data.azurerm_storage_account.witness[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account" "witness" {
      + access_tier                        = (known after apply)
      + account_kind                       = (known after apply)
      + account_replication_type           = (known after apply)
      + account_tier                       = (known after apply)
      + allow_nested_items_to_be_public    = (known after apply)
      + azure_files_authentication         = (known after apply)
      + custom_domain                      = (known after apply)
      + dns_endpoint_type                  = (known after apply)
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + identity                           = (known after apply)
      + infrastructure_encryption_enabled  = (known after apply)
      + is_hns_enabled                     = (known after apply)
      + location                           = (known after apply)
      + name                               = "iacadowitness"
      + nfsv3_enabled                      = (known after apply)
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + queue_encryption_key_type          = (known after apply)
      + resource_group_name                = "zilutest"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + table_encryption_key_type          = (known after apply)
      + tags                               = (known after apply)
    }

  # module.base.module.hci_cluster.data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/base.hci_cluster"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.base.module.hci_cluster.azapi_resource.cluster will be created
  + resource "azapi_resource" "cluster" {
      + body                      = {
          + properties = {}
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "iacado-cl"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.AzureStackHCI/clusters@2024-04-01"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.base.module.hci_cluster.azapi_resource.validatedeploymentsetting will be created
  + resource "azapi_resource" "validatedeploymentsetting" {
      + body                      = {
          + properties = {
              + arcNodeResourceIds      = [
                  + (known after apply),
                  + (known after apply),
                ]
              + deploymentConfiguration = {
                  + scaleUnits = [
                      + {
                          + deploymentData = {
                              + adouPath              = "OU=iacado,DC=jumpstart,DC=local"
                              + cluster               = {
                                  + azureServiceEndpoint = "core.windows.net"
                                  + cloudAccountName     = "iacadowitness"
                                  + name                 = "iacado-cl"
                                  + witnessPath          = "Cloud"
                                  + witnessType          = "Cloud"
                                }
                              + domainFqdn            = "jumpstart.local"
                              + hostNetwork           = {
                                  + enableStorageAutoIp           = true
                                  + intents                       = [
                                      + {
                                          + adapter                             = [
                                              + "FABRIC",
                                              + "FABRIC2",
                                            ]
                                          + adapterPropertyOverrides            = {
                                              + jumboPacket             = ""
                                              + networkDirect           = "Disabled"
                                              + networkDirectTechnology = ""
                                            }
                                          + name                                = "ManagementCompute"
                                          + overrideAdapterProperty             = true
                                          + overrideQosPolicy                   = false
                                          + overrideVirtualSwitchConfiguration  = false
                                          + qosPolicyOverrides                  = {
                                              + bandwidthPercentage_SMB         = ""
                                              + priorityValue8021Action_Cluster = ""
                                              + priorityValue8021Action_SMB     = ""
                                            }
                                          + trafficType                         = [
                                              + "Management",
                                              + "Compute",
                                            ]
                                          + virtualSwitchConfigurationOverrides = {
                                              + enableIov              = ""
                                              + loadBalancingAlgorithm = ""
                                            }
                                        },
                                      + {
                                          + adapter                             = [
                                              + "StorageA",
                                              + "StorageB",
                                            ]
                                          + adapterPropertyOverrides            = {
                                              + jumboPacket             = ""
                                              + networkDirect           = "Disabled"
                                              + networkDirectTechnology = ""
                                            }
                                          + name                                = "Storage"
                                          + overrideAdapterProperty             = true
                                          + overrideQosPolicy                   = false
                                          + overrideVirtualSwitchConfiguration  = false
                                          + qosPolicyOverrides                  = {
                                              + bandwidthPercentage_SMB         = ""
                                              + priorityValue8021Action_Cluster = ""
                                              + priorityValue8021Action_SMB     = ""
                                            }
                                          + trafficType                         = [
                                              + "Storage",
                                            ]
                                          + virtualSwitchConfigurationOverrides = {
                                              + enableIov              = ""
                                              + loadBalancingAlgorithm = ""
                                            }
                                        },
                                    ]
                                  + storageConnectivitySwitchless = false
                                  + storageNetworks               = [
                                      + {
                                          + name               = "Storage1Network"
                                          + networkAdapterName = "StorageA"
                                          + vlanId             = "711"
                                        },
                                      + {
                                          + name               = "Storage2Network"
                                          + networkAdapterName = "StorageB"
                                          + vlanId             = "712"
                                        },
                                    ]
                                }
                              + infrastructureNetwork = [
                                  + {
                                      + dnsServers = [
                                          + "192.168.1.254",
                                        ]
                                      + gateway    = "192.168.1.1"
                                      + ipPools    = [
                                          + {
                                              + endingAddress   = "192.168.1.65"
                                              + startingAddress = "192.168.1.55"
                                            },
                                        ]
                                      + subnetMask = "255.255.255.0"
                                      + useDhcp    = false
                                    },
                                ]
                              + namingPrefix          = "iacado"
                              + observability         = {
                                  + episodicDataUpload  = true
                                  + euLocation          = false
                                  + streamingDataClient = true
                                }
                              + optionalServices      = {
                                  + customLocation = "iacado-customlocation"
                                }
                              + physicalNodes         = [
                                  + {
                                      + ipv4Address = "192.168.1.12"
                                      + name        = "AzSHOST1"
                                    },
                                  + {
                                      + ipv4Address = "192.168.1.13"
                                      + name        = "AzSHOST2"
                                    },
                                ]
                              + secrets               = [
                                  + {
                                      + eceSecretName  = "AzureStackLCMUserCredential"
                                      + secretLocation = (known after apply)
                                      + secretName     = "iacado-cl-AzureStackLCMUserCredential"
                                    },
                                  + {
                                      + eceSecretName  = "LocalAdminCredential"
                                      + secretLocation = (known after apply)
                                      + secretName     = "iacado-cl-LocalAdminCredential"
                                    },
                                  + {
                                      + eceSecretName  = "DefaultARBApplication"
                                      + secretLocation = (known after apply)
                                      + secretName     = "iacado-cl-DefaultARBApplication"
                                    },
                                  + {
                                      + eceSecretName  = "WitnessStorageKey"
                                      + secretLocation = (known after apply)
                                      + secretName     = "iacado-cl-WitnessStorageKey"
                                    },
                                ]
                              + securitySettings      = {
                                  + bitlockerBootVolume           = true
                                  + bitlockerDataVolumes          = true
                                  + credentialGuardEnforced       = false
                                  + driftControlEnforced          = true
                                  + drtmProtection                = true
                                  + hvciProtection                = true
                                  + sideChannelMitigationEnforced = true
                                  + smbClusterEncryption          = false
                                  + smbSigningEnforced            = true
                                  + wdacEnforced                  = true
                                }
                              + storage               = {
                                  + configurationMode = "Express"
                                }
                            }
                        },
                    ]
                  + version    = "10.0.0.0"
                }
              + deploymentMode          = "Validate"
              + operationType           = "ClusterProvisioning"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "default"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.AzureStackHCI/clusters/deploymentSettings@2024-04-01"
    }

  # module.base.module.hci_cluster.azapi_update_resource.deploymentsetting[0] will be created
  + resource "azapi_update_resource" "deploymentsetting" {
      + body                    = {
          + properties = {
              + deploymentMode = "Deploy"
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "default"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.AzureStackHCI/clusters/deploymentSettings@2024-04-01"

      + timeouts {
          + create = "24h"
          + delete = "60m"
        }
    }

  # module.base.module.hci_cluster.azurerm_key_vault_secret.azure_stack_lcm_user_credential will be created
  + resource "azurerm_key_vault_secret" "azure_stack_lcm_user_credential" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "iacado-cl-AzureStackLCMUserCredential"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.hci_cluster.azurerm_key_vault_secret.default_arb_application will be created
  + resource "azurerm_key_vault_secret" "default_arb_application" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "iacado-cl-DefaultARBApplication"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.hci_cluster.azurerm_key_vault_secret.local_admin_credential will be created
  + resource "azurerm_key_vault_secret" "local_admin_credential" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "iacado-cl-LocalAdminCredential"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.hci_cluster.azurerm_key_vault_secret.witness_storage_key[0] will be created
  + resource "azurerm_key_vault_secret" "witness_storage_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "iacado-cl-WitnessStorageKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.hci_cluster.azurerm_role_assignment.machine_role_assign["AzSHOST1_KVSU"] will be created
  + resource "azurerm_role_assignment" "machine_role_assign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci_cluster.azurerm_role_assignment.machine_role_assign["AzSHOST2_KVSU"] will be created
  + resource "azurerm_role_assignment" "machine_role_assign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci_cluster.azurerm_role_assignment.service_principal_role_assign["ACMRM"] will be created
  + resource "azurerm_role_assignment" "service_principal_role_assign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f0e0e122-3f80-44ed-95d2-f56e6fdc514c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Connected Machine Resource Manager"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci_cluster.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.base.module.hci_cluster.random_integer.random_suffix will be created
  + resource "random_integer" "random_suffix" {
      + id     = (known after apply)
      + max    = 99
      + min    = 10
      + result = (known after apply)
    }

  # module.base.module.hci_cluster.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.base.module.hci_insights[0].data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.base.module.hci_insights[0].data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/base.hci_insights"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.base.module.hci_insights[0].azapi_resource.monitor_agent will be created
  + resource "azapi_resource" "monitor_agent" {
      + body                      = {
          + properties = {
              + extensionParameters = {
                  + autoUpgradeMinorVersion = false
                  + enableAutomaticUpgrade  = true
                  + publisher               = "Microsoft.Azure.Monitor"
                  + settings                = {}
                  + type                    = "AzureMonitorWindowsAgent"
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "AzureMonitorWindowsAgent"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.AzureStackHCI/clusters/ArcSettings/Extensions@2023-08-01"
    }

  # module.base.module.hci_insights[0].azurerm_log_analytics_workspace.workspace[0] will be created
  + resource "azurerm_log_analytics_workspace" "workspace" {
      + allow_resource_only_permissions         = true
      + cmk_for_query_forced                    = false
      + daily_quota_gb                          = -1
      + id                                      = (known after apply)
      + immediate_data_purge_on_30_days_enabled = false
      + internet_ingestion_enabled              = true
      + internet_query_enabled                  = true
      + local_authentication_disabled           = false
      + location                                = "eastus"
      + name                                    = "iacado-workspace"
      + primary_shared_key                      = (sensitive value)
      + resource_group_name                     = "iacado-rg"
      + retention_in_days                       = 30
      + secondary_shared_key                    = (sensitive value)
      + sku                                     = "PerGB2018"
      + workspace_id                            = (known after apply)
    }

  # module.base.module.hci_insights[0].azurerm_monitor_data_collection_endpoint.dce[0] will be created
  + resource "azurerm_monitor_data_collection_endpoint" "dce" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + location                      = "eastus"
      + logs_ingestion_endpoint       = (known after apply)
      + name                          = "iacado-dce"
      + public_network_access_enabled = true
      + resource_group_name           = "iacado-rg"
    }

  # module.base.module.hci_insights[0].azurerm_monitor_data_collection_rule.dcr[0] will be created
  + resource "azurerm_monitor_data_collection_rule" "dcr" {
      + data_collection_endpoint_id = (known after apply)
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + location                    = "eastus"
      + name                        = "AzureStackHCI-iacado-dcr"
      + resource_group_name         = "iacado-rg"

      + data_flow {
          + destinations = [
              + "iacado-workspace",
            ]
          + streams      = [
              + "Microsoft-Perf",
            ]
        }
      + data_flow {
          + destinations = [
              + "2-90d1-e814dab6067e",
            ]
          + streams      = [
              + "Microsoft-Event",
            ]
        }

      + data_sources {
          + performance_counter {
              + counter_specifiers            = [
                  + "\\Memory\\Available Bytes",
                  + "\\Network Interface(*)\\Bytes Total/sec",
                  + "\\Processor(_Total)\\% Processor Time",
                  + "\\RDMA Activity(*)\\RDMA Inbound Bytes/sec",
                  + "\\RDMA Activity(*)\\RDMA Outbound Bytes/sec",
                ]
              + name                          = "perfCounterDataSource"
              + sampling_frequency_in_seconds = 10
              + streams                       = [
                  + "Microsoft-Perf",
                ]
            }
          + windows_event_log {
              + name           = "eventLogsDataSource"
              + streams        = [
                  + "Microsoft-Event",
                ]
              + x_path_queries = [
                  + "Microsoft-Windows-SDDC-Management/Operational!*[System[(EventID=3000 or EventID=3001 or EventID=3002 or EventID=3003 or EventID=3004)]]",
                  + "microsoft-windows-health/operational!*",
                ]
            }
        }

      + destinations {
          + log_analytics {
              + name                  = "iacado-workspace"
              + workspace_resource_id = (known after apply)
            }
          + log_analytics {
              + name                  = "2-90d1-e814dab6067e"
              + workspace_resource_id = (known after apply)
            }
        }
    }

  # module.base.module.hci_insights[0].azurerm_monitor_data_collection_rule_association.association["AzSHOST1"] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "association" {
      + data_collection_rule_id = (known after apply)
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.base.module.hci_insights[0].azurerm_monitor_data_collection_rule_association.association["AzSHOST2"] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "association" {
      + data_collection_rule_id = (known after apply)
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.base.module.hci_insights[0].modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.base.module.hci_insights[0].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.base.module.hci_logicalnetwork.data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.base.module.hci_logicalnetwork.data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/base.hci_logicalnetwork"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.base.module.hci_logicalnetwork.azapi_resource.logical_network will be created
  + resource "azapi_resource" "logical_network" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + dhcpOptions  = {
                  + dnsServers = [
                      + "192.168.1.254",
                    ]
                }
              + subnets      = [
                  + {
                      + name       = "default"
                      + properties = {
                          + addressPrefix      = "192.168.1.0/24"
                          + ipAllocationMethod = "Static"
                          + ipPools            = [
                              + {
                                  + end   = "192.168.1.190"
                                  + info  = {}
                                  + start = "192.168.1.171"
                                },
                            ]
                          + routeTable         = {
                              + properties = {
                                  + routes = [
                                      + {
                                          + name       = "default"
                                          + properties = {
                                              + addressPrefix    = "0.0.0.0/0"
                                              + nextHopIpAddress = "192.168.1.1"
                                            }
                                        },
                                    ]
                                }
                            }
                        }
                    },
                ]
              + vmSwitchName = "ConvergedSwitch(managementcompute)"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "iacado-logicalnetwork"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.AzureStackHCI/logicalNetworks@2023-09-01-preview"
    }

  # module.base.module.hci_logicalnetwork.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.base.module.hci_logicalnetwork.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST1"].data.azurerm_arc_machine.server will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_arc_machine" "server" {
      + active_directory_fqdn          = (known after apply)
      + agent                          = (known after apply)
      + agent_version                  = (known after apply)
      + client_public_key              = (known after apply)
      + cloud_metadata                 = (known after apply)
      + detected_properties            = (known after apply)
      + display_name                   = (known after apply)
      + dns_fqdn                       = (known after apply)
      + domain_name                    = (known after apply)
      + id                             = (known after apply)
      + identity                       = (known after apply)
      + last_status_change_time        = (known after apply)
      + location                       = (known after apply)
      + location_data                  = (known after apply)
      + machine_fqdn                   = (known after apply)
      + mssql_discovered               = (known after apply)
      + name                           = "AzSHOST1"
      + os_name                        = (known after apply)
      + os_profile                     = (known after apply)
      + os_sku                         = (known after apply)
      + os_type                        = (known after apply)
      + os_version                     = (known after apply)
      + parent_cluster_resource_id     = (known after apply)
      + private_link_scope_resource_id = (known after apply)
      + resource_group_name            = "iacado-rg"
      + service_status                 = (known after apply)
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + vm_id                          = (known after apply)
      + vm_uuid                        = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST1"].azurerm_role_assignment.machine_role_assign["ACMRM"] will be created
  + resource "azurerm_role_assignment" "machine_role_assign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Connected Machine Resource Manager"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacado-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST1"].azurerm_role_assignment.machine_role_assign["ASHDMR"] will be created
  + resource "azurerm_role_assignment" "machine_role_assign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Stack HCI Device Management Role"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacado-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST1"].azurerm_role_assignment.machine_role_assign["KVSU"] will be created
  + resource "azurerm_role_assignment" "machine_role_assign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacado-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST1"].azurerm_role_assignment.machine_role_assign["Reader"] will be created
  + resource "azurerm_role_assignment" "machine_role_assign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacado-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST1"].modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-ptn-hci-server-provisioner/azurerm"
          + "module_version"  = "0.2.2"
          + "random_id"       = (known after apply)
          + "subscription_id" = "de3c4d5e-af08-451a-a873-438d86ab6f4b"
          + "tenant_id"       = "d9b73d5e-a9d3-41ba-88c3-796a643e3edd"
        }
    }

  # module.base.module.hci_server_provisioner["AzSHOST1"].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST1"].terraform_data.provisioner will be created
  + resource "terraform_data" "provisioner" {
      + id = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST1"].terraform_data.replacement will be created
  + resource "terraform_data" "replacement" {
      + id     = (known after apply)
      + input  = "iacado-rg"
      + output = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST2"].data.azurerm_arc_machine.server will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_arc_machine" "server" {
      + active_directory_fqdn          = (known after apply)
      + agent                          = (known after apply)
      + agent_version                  = (known after apply)
      + client_public_key              = (known after apply)
      + cloud_metadata                 = (known after apply)
      + detected_properties            = (known after apply)
      + display_name                   = (known after apply)
      + dns_fqdn                       = (known after apply)
      + domain_name                    = (known after apply)
      + id                             = (known after apply)
      + identity                       = (known after apply)
      + last_status_change_time        = (known after apply)
      + location                       = (known after apply)
      + location_data                  = (known after apply)
      + machine_fqdn                   = (known after apply)
      + mssql_discovered               = (known after apply)
      + name                           = "AzSHOST2"
      + os_name                        = (known after apply)
      + os_profile                     = (known after apply)
      + os_sku                         = (known after apply)
      + os_type                        = (known after apply)
      + os_version                     = (known after apply)
      + parent_cluster_resource_id     = (known after apply)
      + private_link_scope_resource_id = (known after apply)
      + resource_group_name            = "iacado-rg"
      + service_status                 = (known after apply)
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + vm_id                          = (known after apply)
      + vm_uuid                        = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST2"].azurerm_role_assignment.machine_role_assign["ACMRM"] will be created
  + resource "azurerm_role_assignment" "machine_role_assign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Connected Machine Resource Manager"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacado-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST2"].azurerm_role_assignment.machine_role_assign["ASHDMR"] will be created
  + resource "azurerm_role_assignment" "machine_role_assign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Stack HCI Device Management Role"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacado-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST2"].azurerm_role_assignment.machine_role_assign["KVSU"] will be created
  + resource "azurerm_role_assignment" "machine_role_assign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacado-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST2"].azurerm_role_assignment.machine_role_assign["Reader"] will be created
  + resource "azurerm_role_assignment" "machine_role_assign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/de3c4d5e-af08-451a-a873-438d86ab6f4b/resourceGroups/iacado-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST2"].modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-ptn-hci-server-provisioner/azurerm"
          + "module_version"  = "0.2.2"
          + "random_id"       = (known after apply)
          + "subscription_id" = "de3c4d5e-af08-451a-a873-438d86ab6f4b"
          + "tenant_id"       = "d9b73d5e-a9d3-41ba-88c3-796a643e3edd"
        }
    }

  # module.base.module.hci_server_provisioner["AzSHOST2"].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST2"].terraform_data.provisioner will be created
  + resource "terraform_data" "provisioner" {
      + id = (known after apply)
    }

  # module.base.module.hci_server_provisioner["AzSHOST2"].terraform_data.replacement will be created
  + resource "terraform_data" "replacement" {
      + id     = (known after apply)
      + input  = "iacado-rg"
      + output = (known after apply)
    }

Plan: 55 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11322304976`](https://github.com/duzitong/shiny-umbrella/actions/runs/11322304976) - commit fac9c94bfc1aba6a0b1e81b938fef5ac48a9309c
